In [2]:
import numpy as np
import pandas as pd

In [3]:
p_series = pd.Series([1,2,3,4,5,6,7,8,9,'x'],index=['a','b','c','d','e','f','h','i','j',20])
p_series

a     1
b     2
c     3
d     4
e     5
f     6
h     7
i     8
j     9
20    x
dtype: object

In [4]:
z = {'a':1,'b':2,'c':5}
l = pd.Series(z,index = ['a','b','c','d'])
l

a    1.0
b    2.0
c    5.0
d    NaN
dtype: float64

In [5]:
sz = pd.Series('s',index = [0,1,2,3,5,6,7,8,9])
sz

0    s
1    s
2    s
3    s
5    s
6    s
7    s
8    s
9    s
dtype: object

In [6]:
sz[[0,1,2,3,4,5,6]]

C:\Anaconda3\lib\site-packages\pandas\core\series.py:842: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

0      s
1      s
2      s
3      s
4    NaN
5      s
6      s
dtype: object

In [78]:
f_data = pd.DataFrame([[1,2,3,4,5,6,7,8,9,10,11,12],['a','c','d','e','f','g','h','i','j','k','l','o']])
f_data

  0  1  2  3  4  5  6  7  8   9   10  11
0  1  2  3  4  5  6  7  8  9  10  11  12
1  a  c  d  e  f  g  h  i  j   k   l   o

In [80]:
d = {'one':pd.Series([1,2,3,4],index=['1','2','3','4']),'two':pd.Series([1,6,7,8],index=['1','2','3','4'])}
df = pd.DataFrame(d)
df

   one  two
1    1    1
2    2    6
3    3    7
4    4    8

In [83]:
df['four'] = df['one'] + df['two']
df

   one  two  four
1    1    1     2
2    2    6     8
3    3    7    10
4    4    8    12

In [84]:
df['three'] = df['one'] - df['two']
df

   one  two  four  three
1    1    1     2      0
2    2    6     8     -4
3    3    7    10     -4
4    4    8    12     -4

In [86]:
df[['one','two','three'][-1][:]]
df[1:2]

   one  two  four  three
2    2    6     8     -4

In [87]:
ds = {'one':pd.Series([1,2,3,4],index = ['a','b','c','d']),'two':pd.Series([5,6,7,8],index=['a','b','c','d'])}
dfs = pd.DataFrame(ds)
dfs

   one  two
a    1    5
b    2    6
c    3    7
d    4    8

In [102]:
dfs['three'] = pd.Series([8,9,10,11])

In [103]:
dfs['three'] = pd.Series([8,9,10,11],index = ['a','b','c','d'])

In [104]:
dfs['four'] = pd.Series([32,33,36,39],index = ['a','b','c','d'])

In [105]:
dfs

   one  two  three  four
a    1    5      8    32
b    2    6      9    33
c    3    7     10    36
d    4    8     11    39

In [144]:
dfz = dfs.append(df)
dfz

C:\Anaconda3\lib\site-packages\pandas\core\frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

   four  one  three  two
a    32    1      8    5
b    33    2      9    6
c    36    3     10    7
d    39    4     11    8
1     2    1      0    1
2     8    2     -4    6
3    10    3     -4    7
4    12    4     -4    8

In [145]:
dfs

   one  two  three  four
a    1    5      8    32
b    2    6      9    33
c    3    7     10    36
d    4    8     11    39

In [146]:
dfz = dfz.drop('d')
dfz

   four  one  three  two
a    32    1      8    5
b    33    2      9    6
c    36    3     10    7
1     2    1      0    1
2     8    2     -4    6
3    10    3     -4    7
4    12    4     -4    8

In [147]:
del dfz['two']
dfz

   four  one  three
a    32    1      8
b    33    2      9
c    36    3     10
1     2    1      0
2     8    2     -4
3    10    3     -4
4    12    4     -4